app/controllers/api/servers_controller.rb

    def join
        @server = Server.find_by(invite: params[:invite])

        if @server
            ServerUser.create!(user_id: current_user.id, server_id: @server.id)
---
SELECT  "servers".* FROM "servers" WHERE "servers"."invite" = $1 LIMIT $2  [["invite", "[object Object]"], ["LIMIT", 1]]
INSERT INTO "server_users" ("user_id", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 122], ["server_id", 187], ["created_at", "2020-03-09 04:18:47.731341"], ["updated_at", "2020-03-09 04:18:47.731341"]]