app/controllers/api/servers_controller.rb

    def create
        @server = Server.new(server_params)
        if @server.save
            ServerUser.create!(user_id: current_user.id, server_id: @server.id)
            @active_channels = {}
            @active_channels[@server.id] = @server.channels.first.id
---
INSERT INTO "servers" ("name", "invite", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["invite", "IkVh5w"], ["owner_id", 104], ["created_at", "2020-03-06 17:54:42.525711"], ["updated_at", "2020-03-06 17:54:42.525711"]]
SELECT  "servers".* FROM "servers" WHERE (Mf11LA) LIMIT $1  [["LIMIT", 1]]
SELECT  "server_users".* FROM "server_users" WHERE "server_users"."user_id" = $1 LIMIT $2  [["user_id", 104], ["LIMIT", 11]]

    def show
        @server = Server.find_by(id: params[:id])
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 145], ["LIMIT", 1]]

    def update
        @server = Server.find_by(id: params[:server][:id])
        if @server.update(name: params[:server][:name])

            if !params[:server][:profile_pic].nil?
                @server.profile_pic.purge
                @server.profile_pic.attach(params[:server][:profile_pic])
            end
            @active_channels = {}
            @active_channels[@server.id] = @server.channels.first.id
            @messages = []
            @server.channels.each do |channel|
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 154], ["LIMIT", 1]]
UPDATE "servers" SET "name" = $1, "updated_at" = $2 WHERE "servers"."id" = $3  [["name", "just memes no dweams"], ["updated_at", "2020-03-09 06:55:20.036100"], ["id", 195]]
SELECT "servers".* FROM "servers"
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 187], ["LIMIT", 1]]

    def index
        @servers = current_user.servers.includes(:members, :memberships, :channels)
---
SELECT "servers".* FROM "servers" INNER JOIN "server_users" ON "servers"."id" = "server_users"."server_id" WHERE "server_users"."user_id" = $1  [["user_id", 104]]

    def join
        @server = Server.find_by(invite: params[:invite])
        if @server
            ServerUser.create!(user_id: current_user.id, server_id: @server.id)
            @active_channels = {}
            @active_channels[@server.id] = @server.channels.first.id
---
SELECT  "servers".* FROM "servers" WHERE "servers"."invite" = $1 LIMIT $2  [["invite", "Mf11LA"], ["LIMIT", 1]]
INSERT INTO "server_users" ("user_id", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 104], ["server_id", 154], ["created_at", "2020-03-06 19:21:43.194318"], ["updated_at", "2020-03-06 19:21:43.194318"]]
SELECT  "servers".* FROM "servers" WHERE (Mf11LA) LIMIT $1  [["LIMIT", 1]]