app/controllers/application_controller.rb

    def current_user
        current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "YAnOX12U75yte-U6N7Nn5A"], ["LIMIT", 1]]