app/models/server.rb

    def generate_invite
        return if self.invite
        self.invite ||= SecureRandom.urlsafe_base64(4)
        unless (Server.pluck(:invite).count(self.invite) == 1)
---
SELECT "servers"."invite" FROM "servers"

    def default_channel
        Channel.create!(name:"general", is_dm?: false, server_id: self.id)
---
INSERT INTO "channels" ("name", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "general"], ["server_id", 156], ["created_at", "2020-03-06 19:48:08.189287"], ["updated_at", "2020-03-06 19:48:08.189287"]]