app/models/user.rb

    def reset_session_token
        self.update(session_token: SecureRandom.urlsafe_base64)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "jLNpj40aPl5HeOlhD-hX6g"], ["updated_at", "2020-03-02 23:57:25.788822"], ["id", 1]]