app/models/user.rb

    def self.find_by_creds(email, password)
        user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "y"], ["LIMIT", 1]]

    def reset_session_token
        self.update(session_token: SecureRandom.urlsafe_base64)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "T4k21iJpifolOAXHiYrgrg"], ["updated_at", "2020-03-05 01:55:54.720566"], ["id", 55]]

    def generate_home_server
        Server.create!(name: "Home", private: true, owner_id: self.id)
---
INSERT INTO "servers" ("name", "invite", "owner_id", "created_at", "updated_at", "private") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Home"], ["invite", "UgeHG5gkL7HONAh2m106cg"], ["owner_id", 55], ["created_at", "2020-03-05 00:49:04.959927"], ["updated_at", "2020-03-05 00:49:04.959927"], ["private", true]]

    def ensure_user_number
        return if self.user_number
        self.user_number ||= rand(0000..9999)
        # need to check if other_users have their name
        other_users = User.select(username: self.username);
        # get their user_numbers
        other_nums = other_users.pluck(:user_number)
        # debugger
        if other_users # if they are found keep generating until not
            while other_nums.include?(self.user_number)
---
SELECT "users"."user_number" FROM "users"